

{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Poems - Nicolas Greenwood",
  "home_page_url": "https://nicolasgreenwood.github.io/?utm_source=json_feed",
  
  "description": "I'm an 18 year old aspiring multidisciplinary artist based in Novi Sad, Serbia. My work includes, but is not exclusive to, poetry, prose, design, programming and visual art.",
  "icon": "https://nicolasgreenwood.github.io/img/open-graph-logo_hu_1978870e36bf97f6.png",
  "favicon": "https://nicolasgreenwood.github.io/img/open-graph-logo_hu_1978870e36bf97f6.png",
  "authors": [
    {
      "name": "Nicolas Greenwood"
    }
  ],
  "language" : "en",
  "items": [
    {
      "id": "9da89c93-173d-59af-e9c9-d36163c281bf",
      "url": "https://nicolasgreenwood.github.io/poems/truly-it-comes-as-no-surprise/?utm_source=json_feed",
      "title": "Truly, It Comes as No Surprise",
      "summary": " Edvard Munch, 1893, The Scream. Credit: Wikimedia Commons License: Public Domain\nA note on this poem: It is not the first time the shadow of inevitability—rather unintentionally, I admit—has crept into my poetry. It is such a poetic idea, you know, to be aware of one’s own nonsense, to sing of the unpreventable. This is not always a negative thing. In this poem, however, it is.\nThis is, unapologetically, a composition on oppression. Not just any oppression, but the kind where the line separating the oppressor and the oppressed blurs. Such is the worst kind of tormentor: the kind who torments by causing the victim to torment themselves. Their return, after so many visits, comes as no surprise to the narrator.",
      "date_published": "2025-09-15T00:00:00Z"
    },
    {
      "id": "51c487bc-4d4f-5e34-d9a3-68b691452b5a",
      "url": "https://nicolasgreenwood.github.io/poems/to-the-depths-of-the-ionian-sea/?utm_source=json_feed",
      "title": "To the Depths of the Ionian Sea",
      "summary": " In memoriam, Vladislav Petković Dis\n(1880-1917)\nWe sink, for the shore\u0026rsquo;s to far to see We fall from a dark and ominous sky To the depths of the Ionian Sea. From the deep we pulled up our anchors three With bleeding hands we raised our colors high We sink, for the shore\u0026rsquo;s too far to see. We dream of nothing but eternity We descend to a place where great men lie To the depths of the Ionian Sea. Lo, our hearts yet beat, our eyes yet see! Oh hollow deep! Drown not our cry! We sink, for the shore\u0026rsquo;s too far to see. O\u0026rsquo;er life Fate has chosen serenity To eternal rest like birds we fly To the depths of the Ionian Sea. To our tombs ordained by Deity Below the waves\u0026rsquo; unceasing lullaby We sink, for the shore\u0026rsquo;s too far to see To the depths of the Ionian Sea. A note on this poem: Serbian poet Vladislav Petković Dis (1880 - 1917)",
      "date_published": "2025-06-19T00:00:00Z"
    },
    {
      "id": "388fe3aa-b3ca-5413-d932-fe6ed2520c33",
      "url": "https://nicolasgreenwood.github.io/poems/dreaming-of-you/?utm_source=json_feed",
      "title": "Dreaming of You",
      "summary": " Moths dance in the streetlight as You lean on my shoulder. Shadows play On a brick wall and We are silent. We do not think, but watch Moonlit leaves wave And listen to the hum of night Against the foreground of each other’s breathing. And though the clouds have covered The stars I know from view Though the words you whispered Are no longer true I still say them to myself And the dream the voice is you And dream the voice is you. We are standing on a bridge The sunlight is white and strange Your face is marble and stone Marble and stone—and the wind Blows through us as we stand From a great height over a river I once dropped a ring into A ring for you. And though a hand has covered The eyes I know from view Though the words I whispered Are no longer true I still say them to myself And dream I speak to you And dream I speak to you. For Ms. M. R.",
      "date_published": "2025-06-18T00:00:00Z"
    },
    {
      "id": "4705da60-5cf0-5572-09de-f6def9878d8f",
      "url": "https://nicolasgreenwood.github.io/poems/i-wrote-this-beneath-stars/?utm_source=json_feed",
      "title": "I Wrote This Beneath Stars",
      "summary": " A bottle of ink spilled onto a sheet of paper My tears fell too It dried into a poem. Did you know that even stars die? I whisper to them, you are eternal! I still do Because all eternity means to me is existence beyond when I cease to exist. If only I could die before you! So that you could become eternal Like the stars. I wrote this beneath stars. ",
      "date_published": "2025-06-17T00:00:00Z"
    },
    {
      "id": "8dde4461-864c-527f-e913-bfbd3b113851",
      "url": "https://nicolasgreenwood.github.io/poems/horizon/?utm_source=json_feed",
      "title": "Horizon",
      "summary": " Claude Monet, Impression, Sunrise (1872) Credit: Wikimedia Commons License: Public Domain\nTo the aisles we turn our bow To the distance we point our gaze Through foreign seas our boat we row To drifting winds our sails we raise. By fading stars we chart our way With feeble hands our wheel we spin B’neath stormy skies our prayers we say With silent tears our days begin. Our eyes we fix on that line The only shore we’ll never beach A place where sea and sky combine Forever there, just out of reach. ",
      "date_published": "2025-06-16T00:00:00Z"
    },
    {
      "id": "0c72dc34-6421-5537-6940-722cd22bde64",
      "url": "https://nicolasgreenwood.github.io/poems/faces/?utm_source=json_feed",
      "title": "Faces",
      "summary": " On thirsty ground our footsteps fall Through barren sand our fingers trace Faces with untempered grace Untouched by the impossible. A thousand times the words we\u0026rsquo;ve said Do we mean them is the question Do words come before connection? To love conceive must we pretend? Or are our hearts set on fire On their own; can a flame ignite Without a spark; do souls unite Truly by their own desire? ",
      "date_published": "2025-06-10T00:00:00Z"
    },
    {
      "id": "933c03e3-dbb8-534a-497d-67d3f26d212e",
      "url": "https://nicolasgreenwood.github.io/poems/vreme/?utm_source=json_feed",
      "title": "Време (Time)",
      "summary": " \u0026ldquo;Yes, of course I’m afraid of death, but no less so my own life.”\nTarfia Faizullah (scroll for translation)\nСурово је то време јер кад падне мрак, тај дан не може да се врати. Кад падају сузе — оне су пале, заувек. Јер крв, кад се проли, више не остаје у телу. Јер сећања не могу бити иста као стварност. Сурово је то време. Сурово је то време јер где је смрт прошла, живот не прати. Јер је прошлост нешто што не постоји. А оно што видимо — нестане и нестане! Сваки тренутак је пролазни тренутак. Сурово је то време. Мило је то време јер кад дува ветар — дува у налетима. Јер у истом дану сунце сија с обе стране неба. Јер нам даје крај пре него што живот постане предуг и горак. Мило је то време. Мило је то време јер ни добро ни зло не постају вечни. Јер сузе, када падну, падну — и пресуше. А време даје лепоти њену круну, јер лепота, кад је пролазна, бива још лепша. Мило је то време. English translation Time Cruel is time because When darkness falls, that day cannot return When tears fall, they are fallen forever Because blood, when spilled, remains not in the body Because memories are not the same as reality Cruel is time. Cruel is time because Where death has passed, life does not follow Because the past is something that doesn’t exist And everything we see — vanishes and vanishes!1 Every moment is a passing moment Cruel is time. Merciful is time because When wind blows, it blows in gusts. Because in the same day the sun shines on both sides of the sky. Because it gives us an end before Life becomes long and bitter. Merciful is time. Merciful is time because neither good nor evil become eternal. Because tears, when they fall, fall — and dry up. And time gives beauty her crown, because beauty, when fleeting, is only more beautiful. Merciful is time. The Serbian word used here, nestane (translated as vanishes), can also be translated as disappears, or ceases to exist.\u0026#160;\u0026#x21a9;\u0026#xfe0e;",
      "date_published": "2025-05-20T00:00:00Z"
    },
    {
      "id": "b8e0d030-e792-578c-b918-671c8428e875",
      "url": "https://nicolasgreenwood.github.io/poems/the-chapter-of-love/?utm_source=json_feed",
      "title": "The Chapter of Love",
      "summary": " Suddenly your hand is in mine We look not at each other’s face We walk on In glorious silence. Sometimes The days are too long to notice But today is too short to forget; I know not why But somehow it seems Like the very raindrops Are tears of joy. Walk! Walk on Vila and mortal both For rarely comes beauty And without thought on its transience Should be enjoyed. My eyes fall shut In silence I feel The presence of a human being ’Tis a wave in the heart and a tear in the eye. Quietness; Quietness, save for the patter of raindrops The patter of raindrops And the breath of the one Of the one I love. What is it like to feel a million things And say not a word at all? It is a glow to the eye and a flame to the chest It is a wind to the hair and a glow to the brow It is a silent smile Deeper than a thousand seas. One time we went To the riverbank in the sun The stones were hot The water was cold It made our fingers drip It made her laugh It was organic I remember the smell. That was the time I laid my back to a green bank Saw the clouds And suddenly felt her precious weight On me. Oh bitter tears! Fall and may the ground soak you up May the river carry you to the sea Fall and never return. There was once a sunny alleyway A cracked street A rough wall A creeping vine. There we walked The surface of the walls Was rough beneath my fingers. There I heard a whisper That I still repeat to myself Like a mantra in the dark. My cheek pressed to those very stones That I once dreamed of in my sleep ’Twas there that a revelation Descended to me from above That life was but a story Told by pages turned not with hands of our own And that the very wind in our facesIs the passage of time. It was then that I saw The words were hidden in the shine of her eyes That beneath the gentle arc of of the sun Was being told The chapter of love. ",
      "date_published": "2025-04-05T00:00:00Z"
    },
    {
      "id": "0a926f8d-fbed-51c4-19f5-2ca45da19069",
      "url": "https://nicolasgreenwood.github.io/poems/streetlight/?utm_source=json_feed",
      "title": "Streetlight",
      "summary": " In silence it glows In her hand a rose From her gaze she knows We shall glimpse no more the sun. In darkness complete In bitterness sweet Our tears on concrete We listen to the echo of our own laughter. That was long ago Before the sun’s glow Left the skies we know And left us alone in streetlight. Your hands touch my face A tear to erase Your finger’s soft trace Draws a line through a coat of ashes. Hear the glow of night See the frozen light Of a silv’ry white Moon that listens to our smallest whispers. In our arms to die Beneath a dark sky Is our destiny So it seems, so it shall be. So to my eyes raise Your heartbroken gaze To see through the haze Of a fading streetlight that you wither not in solitude. ",
      "date_published": "2025-04-04T00:00:00Z"
    },
    {
      "id": "7dc5070c-5e8a-5b20-f9de-357ab6e7dcf9",
      "url": "https://nicolasgreenwood.github.io/poems/prolece/?utm_source=json_feed",
      "title": "Proleće (Spring)",
      "summary": " Part 1: Proleće from behind a window\nIt came one morning When I was asleep it came I opened my eyes to a flood of sunlight crystal sky kissing breeze. Lo, darkness had faded away Faded away Given way to the power of light. Curtains slipped through my fingers To the window was my forehead pressed I closed my eyes And let tears stain the glass — the glass was cold The sun was warm The sun was hot. It was golden! — it washed my face in gold It was light I could feel light Power The power of life. Part 2: Proleće from beneath trees",
      "date_published": "2025-03-18T00:00:00Z"
    },
    {
      "id": "a274db29-5b4d-5597-e9c7-e3a07da77cfb",
      "url": "https://nicolasgreenwood.github.io/poems/you-remind-me/?utm_source=json_feed",
      "title": "You Remind Me",
      "summary": " You remind me of a time When I smiled with tears on my cheeks When you graced me with your presence When I dipped my fingers into the stream. You remind me of a time When the wind was cool When it blew your hair And covered your eyes. You remind me of a time When I gazed at the clouds My back to the earth And saw your face in them. ",
      "date_published": "2025-03-03T00:00:00Z"
    },
    {
      "id": "60ded721-d588-518a-c9ff-90e9c0494f93",
      "url": "https://nicolasgreenwood.github.io/poems/to-you/?utm_source=json_feed",
      "title": "To You",
      "summary": " All my life I have dreamed of you I’ve seen your shadow in the rain Your face in water’s reflection Dancing just out of my vision Disappearing when I awake. Don’t leave me now, but don’t come too close Stay there forever, above me Where I can feel your sweet presence Just enough to sweeten my days. Yes, you make the sun shine brighter You make my tears all the hotter You make the rain ever colder Until I’m dripping with passion With my heart alive in my chest Gliding away into the sky Feeling motion with my eyes closed And spinning delirium. Stay in my imagination Don’t touch my face or kiss my lips Lest you fade from my dreams for good And you lose the magic sparkle Of your two ever-fading eyes. ",
      "date_published": "2025-03-03T00:00:00Z"
    },
    {
      "id": "e9e2fefe-44de-5a7f-e94e-169be5db89c1",
      "url": "https://nicolasgreenwood.github.io/poems/absence/?utm_source=json_feed",
      "title": "Absence",
      "summary": " For some reason I do not know Your hand slipped away from my own It slipped away without a word In silence, I was left alone. I asked the stars to tell me why From a life your presence had graced You faded away so softly To a city so distant placed; They replied not a word at all I was left flying through their light On a field wet with starlit dew In a dream with no end in sight. My tears fell into a river It caried them down to the sea There in that tomb of mankind’s tears To billow for eternity. Then in the wind I heard your voice Not a word — alas — just a moan A sweet-breathed whisper on my face Though the night from a land unknown. I felt your touch in the cold gusts Your presence borne upon its wings Filling my chest with shards of you A sculpture made of broken things. I embraced that sweet empty place A spirit made of thoughts of you For one short night, before the time To vanish, once again, was due. ",
      "date_published": "2025-03-03T00:00:00Z"
    },
    {
      "id": "9f0463de-c950-5d5f-993f-238cd99107ab",
      "url": "https://nicolasgreenwood.github.io/poems/dear-pacific/?utm_source=json_feed",
      "title": "Dear Pacific,",
      "summary": " Aerial photograph of Haystack Rock in Cannon Beach, Oregon. Credit: DiscoverWithDima License: CC BY-SA 4.0\nDear Pacific,\nYou covered my face with freshness \u0026lsquo;Twas inside the roar I felt your balm Of foaming brine washed ashore With celestial reflection from the sky Dancing below me in silvery grey. I watched your waves leap at the clouds Beneath the surface a depth untold You hid with an ominous mantle Of shimmer bright and waves hypnotic A forgotten tale below the light of day. Beneath your ripples of molten lead I glimpsed a world of iridescent blue A place where tears are never shed That fades into darkness’s oblivion Like the sky’s night that fades away. I saw palm trees bent in the wind A wind that made the grains of sand dance Lo, the sky wept; I saw her tears fall The rain lent tears to my windswept cheeks Your angry waves swirled into the bay. Then, like a dream, it was all gone The moonlight reflected off your ripples You whispered something I couldn’t understand Something about love, something about hate Something about a face that slipped away. Ah, tell me, mysterious waves The secrets you hold beneath your foam The sights you saw, the ages that passed you Tell me a story of your origins Of the times before night and day. Did you freeze into an icy stone When you traversed the cosmic hall Glittering with the light of stars All to one day wash these humble shores And splash these cliffs with glorious spray? And what of tomorrow, dear ocean Whither lies your next destination? What alien sky will you reflect? What foreign shores will you carve and sculpt Oh beautiful ocean, so blue, so grey? I understand it now; I hear your voice; The answer lies in that strange place Where the stars and your surface meet Called the horizon by a few of us Where begins and ends night and day. ",
      "date_published": "2025-02-05T00:00:00Z"
    },
    {
      "id": "52ca96ef-f227-5d99-89cd-109887d32ade",
      "url": "https://nicolasgreenwood.github.io/poems/to-the-butterfly/?utm_source=json_feed",
      "title": "To the Butterfly",
      "summary": " Sunlight glowed through the orange translucence Of her delicate wings patterned with black; Vibrance bursted in green luminescence Through the leaves above waving forth and back. In delighted frenzy she fluttered on Through a forest of light, beauty untold; The beads of dew lit by the rays of dawn Flew past beneath her in flashes of gold. Her life’s a dream but a single day long From dawn to dusk lasts her transient flight ‘Tis a life too short to understand wrong For a soul too pure to ever see night. In blissful ignorance her day flies past With rapturous delight at every sight; Every flower a beauty unsurpassed Each moment closer to eternal night. March, butterflies, to the grand drum of Time — Flutter and dance while your hearts still thunder; Plunge in that intoxication divine Let euphoria rend you asunder. Pause not for a moment in your pursuit Waste not an instant of your life in thought! Life’s a withering tree so reap its fruit Snatch the sweetest clusters before they rot. Flutter and dance into the jaws of death Yes, dance as a symbol of defiance; In beauty’s madness breathe your final breath Embrace death in defiant compliance. For in the futility of it all Resides a great, unbearable beauty; Keep your eyes fixed on the light as you fall — Dance, oh butterfly, as is your duty! ",
      "date_published": "2024-10-20T00:00:00Z"
    },
    {
      "id": "f18b8ab7-956e-515e-c96b-80e170331adb",
      "url": "https://nicolasgreenwood.github.io/poems/the-arab-and-the-drum/?utm_source=json_feed",
      "title": "The Arab and the Drum",
      "summary": " Gold was the color of the sky Washed out with a tint of pale blue Gold was the color of the sand Whipped into spirals the wind blew Gold was the color of the ring On his finger beating the drum It flashed brightly with every beat In the fierce Arabian sun. Alone he was in the whole world Save for the camel at his side With reign in hand and head bowed down He kicked the sand with every stride. His eyes dark beneath his lashes Beneath the cloth glistened his brow His breath came in short tired gasps All his life was forgotten now. It was only the burning rays The ripples in the sea of sand They quivered, they rolled like the waves He was sailing away from land. The dunes hummed the song of the earth His heartbeat sounded in his ears His tongue was dry and his throat choked The sand flashed like a thousand mirrors. He could not breathe, he could not see He was not alive, he was dead He was a carcass with a drum A corpse with a tune in his head. A flick of his wrist and his thumb A hollow thump in step, in beat A light touch of his thumb came next A pause, then eternal repeat. \u0026lsquo;Twas balm to the soul of man To feel the rhythm pulse through him To lose himself in the pattern The tempo of hope and ruin He could hear it in the wind\u0026rsquo;s roar Feel it in the sand in his hand The whole world\u0026rsquo;s moaning in sadness The whole world\u0026rsquo;s tears beneath the sand. Orange glowed beneath his eyelids As linen brushed his weathered cheek Warmth and color fused into dreams Amid the arid gusty shriek. The shriek - it morphed into a scream He saw a girl against the sky Her hair was torn, her face was wet Across the world echoed her cry. The wind - it blew into a hum Of the radio\u0026rsquo;s hiss and wail In the dusty taxis of Cairo Every song an unfinished tale. The car\u0026rsquo;s windows were shaking frames Of scenes through a filter of dust He remembered the shadows\u0026rsquo; shapes On the sun the color of rust. It was so hot he smelled the heat The scent of spark, and steel, and stone He was spinning in red darkness With himself and his dreams alone. A flick of his wrist and his thumb A hollow thump in step, in beat A light touch of his thumb came next A pause, then eternal repeat. Now he was in Giza\u0026rsquo;s alleys Wires crossed the dark sky above The windows were glowing orange His turban as white as a dove. There was rubble all around him There was a fire in his eyes The dream of flight in his bosom There were stars like sparks in the skies That was euphoria, he knew But back then he had forgotten To remember his tearful days From whose womb he was begotten. He had not seen his mother\u0026rsquo;s eyes He had forgotten all of them Now her voice was making him shake Now there was pain inside of him. He was blinded by flashing light Yes, yes - it was a reflection It was from her golden earrings The sun on her smooth complexion Was not that in another world? Not in the world of his closed eyes In his heavy chest, his short gasps Like from hell seeing paradise. He felt the wind in his fingers A tremor shivered through his spine His heartbeat matched the drum\u0026rsquo;s rhythm His lashes the horizon\u0026rsquo;s line. A flick of his wrist and his thumb A hollow thump in step, in beat A light touch of his thumb came next A pause, then eternal repeat. A pattern above the pattern A hidden beat within the beat A song of grief, of wind, of sand Flaming passions drowning in heat. Could a rhythm relive a life? Could a dream add to his years? Could a drum change the heart of man? Could the sun and wind dry his tears? Now he saw a linen pattern It was draped over her bent head Cast carelessly over her shoulder There were stains of blood on the bed He remembered that bright pattern With white lilies from the Nile Against a background of sky blue He thought about that a while. The only beautiful symbol In a room of darkness and pain A patch of sweet color, of hope A patch of sky through clouds of rain. That feeling that burned his bosom No, no - it set him on fire It flooded him and made him fly Higher and higher and higher. He remembered that it was love Ecstasy boiling in him Then laughter spilling out of him His head shaking in the rhythm. A flick of his wrist and his thumb A hollow thump in step, in beat A light touch of his thumb came next A pause, then eternal repeat. The sun and moon exchanged places A piercing cold wind swept the sands Around a pit of dancing flames The Bedouin clan warmed their hands. The ever-present drum echoed It resounded through the cold air Alone in majestic silence Beneath the whitish moonlit glare. Allah! Hear the sons of men\u0026rsquo;s sounds Hear their senseless beat, mad delight In so puny a thing - the drum Lo, they lose themselves all the night. Lose themselves in a strange pattern One only they can feel and hear It\u0026rsquo;s a mirage in the rhythm It\u0026rsquo;s an illusion in the ear. Oh Allah, see our senseless joy Have mercy on the souls of men For we are blown like grains of sand From sorrow to joy like children. Our passions are like gusts of wind One moment a hum, then a scream Foaming at the lips with madness Of delight at a passing dream To dripping at the eyes with tears At grief we do not understand Oh Allah, have mercy on us! We have fallen - extend your hand! A flick of his wrist and his thumb A hollow thump in step, in beat A light touch of his thumb came next A pause, then eternal repeat. ",
      "date_published": "2024-09-07T00:00:00Z"
    },
    {
      "id": "2d7da56a-4181-5578-b9a2-0f5c463850b9",
      "url": "https://nicolasgreenwood.github.io/poems/burnaj/?utm_source=json_feed",
      "title": "Burnaj",
      "summary": " A clenched fist descended On the point on the map The village was besieged Explosions shrieked The wind screamed Jaws clenched Triggers squeezed Smoke drifted Foreign boots pounded The dust of a man’s homeland. ‘Twas the whisper of a traitor He heard in the notes Of an ominous wind A five-pointed star The color of blood Was on their shoulders They were in the village They shouted, they fired It swam before his eyes He watched them through a slit In a cracked wall His faithful friend at his side They were coming for them. “Surrender,” was beneath their breath They dared not say that word Yet it was written All over the walls It was heard In shots’ echoes And soldiers’ shouts. In that very moment A vision flashed before his eyes The rivers of Takhar The mountains, the stones His father’s piercing eyes The Chah Ab he knew His land in freedom His brothers’ blood The dust beneath his shoes All of it screamed for justice The wind was calling his name From the mountains. The pair - they fled The man and his trusty friend Over low walls and flat roofs A secret route known only to them. As silent as the hawks They slipped through the brush Their brothers’ cries Echoing in their ears Each a pang of grief In their thumping chests And yet they ran on They ran on and on. Was this not for Chah Ab? Was this not for honor? Was this not for Allah? The small alleys flashed by them In moving blur The explosions echoed farther And farther away. A scent of hope Was in the air Their feet flew over the dust Their shadows danced in concealment The wind carried them forward With swiftness. The other side they reached Their hearts pounding Their lungs gasping Their eyes squinting Their minds racing. A pounding of hooves was heard A gallop, a thunder A cloud of sunlit dust A horse’s neigh, a glimpse It broke into view It crossed their path It appeared in front of them. “Burnaj!” exclaimed the man In whispered delight, in honest shock His beloved steed His Bucephalus His father’s gift. Two brothers had been swept Off the animal’s back Their martyr’s blood hurled Across their nation’s ground And now In miraculous synchronicity From the farm he had galloped To his master’s hidden path To save him from destruction To save Chah Ab Alone, by himself A horse’s heart, who can know? He had seen martyr’s blood He was a steed of Takhar A horse of the Jihad Of Afghan blood and mane. Allah infused his limbs with strength His power flooded his body Now his master he carried At time right, at moment crucial Through the stony path Up the slopes to the hills Where a new battle was born A dream was dreamt once again Of that Chah Ab In the heart of every man Free; their own. The cause for which his brothers had died Was taken up again Beat loudly in their hearts As they tore through the wind On the back of a horse A horse named Burnaj. ",
      "date_published": "2024-08-26T00:00:00Z"
    },
    {
      "id": "ef30edfe-b9aa-5fe8-2985-b5074cc32585",
      "url": "https://nicolasgreenwood.github.io/poems/refugees-song/?utm_source=json_feed",
      "title": "Refugee's Song",
      "summary": " I caught a last glimpse of you, moonlit home Through a dusty window, when my eyes closed I open them far, far away, alone. An ocean and ten mountains from that night, That glimpse of you still burns my closed eyelids \u0026lsquo;Tis a strange land around me in sunlight. Drops of rain fall from a sky not my own My fists have been clenched since I left your doors I open them far, far away, alone. My only solace is silver starlight – You\u0026rsquo;re my last piece of home, glittering sky \u0026lsquo;Tis a strange land around me in sunlight. Only under your light am I back home My eyes closed, I\u0026rsquo;m there in the golden dust I open them far, far away, alone. Beauty in chaos are my dreams at night In them I live; day is oblivion My feet in stumble and my mind in flight \u0026lsquo;Tis a strange land around me in sunlight. ",
      "date_published": "2024-04-21T00:00:00Z"
    },
    {
      "id": "d0d34e10-e9bb-5606-69ad-77f3386988a8",
      "url": "https://nicolasgreenwood.github.io/poems/a-conversation-with-myself/?utm_source=json_feed",
      "title": "A Conversation With Myself",
      "summary": " Remember those times? Remember how you felt? It was all thoughts and silence Laughter and sunshine Pain and tears like a rainfall That was still somehow refreshing. Photographs don’t convey it Words don’t describe it Only memory does it justice. There was bright green grass There were dozens of faces Your heart was still plain And empty of knowledge Which made you the wisest In sweet innocence. You felt every note of music Every waving leaf Every ripple of water And every ray of sunlight; They touched your soul And sent it quivering And you never knew it. Do you hear those echoes? They’re the sounds of life They’re black and silver With beams of white light They glitter and flash Like beads of water And freeze in midair Like the dance of starlight itself. Now you’re walking Down these busy streets Faces slide by your vision In streaked blur of color The sky above you is framed With the glass and steel of Urbania And at your feet the patterns Of bricks are hypnotizing; Wind is ripping through your hair And you feel so strong and sad. Tears sprout in silver reflection Your smile came unnoticed And your heart is filled With bittersweet power. Childhood’s gone for ever And it’s better that way But were there one or two things You wish you could’ve done Or not done? Ah, ‘tis life! That’s the price to pay For this thrill of vitality And what I already have From that hazy, dreamy era Is in my heart already Where I’ll keep it forever And brave the salty brine Of the storms of life. ",
      "date_published": "2024-04-13T00:00:00Z"
    },
    {
      "id": "c0eba711-a48e-5efa-69d1-b42291ca2933",
      "url": "https://nicolasgreenwood.github.io/poems/egypt/?utm_source=json_feed",
      "title": "Egypt",
      "summary": " I feel the wind, the sun beams’ reflection On my eyelid’s rim - liquid gold fire; Illuminated dust floats before me Licking the air like flames leaping higher. Through bluish haze I see waving palms The pyramids of Giza stand behind Like sentinels of this enchanted land Their monolithic presence slows the time. I step forward, my vision bathed in light In my ear the wind whispers ancient tales Of Pharaohs, of magic, of mighty acts Of great warriors whose heart never quails. Of thundering horses and chariots Of the battle, of the uplifted spear Of a past era of glory untold A great empire the whole world did fear. Visions pass before my astonished eyes I see gold and palaces bright; I see the glory and pomp of the gods Bugles are blown, men tremble in his sight. Son of the sun he is, of divine kin The ground shakes beneath his golden sandals The sun glitters against his golden mask The wind blows his royal purple mantles. Garlands, flowers of color brilliant Tossed by his subjects, do adorn his path; For he is Pharaoh, the divine of earth Lord of all, and fatal is his wrath. He fades away, a new vision appears Of dunes, of camels; through a hazy mist The Arab leads his precious caravan His first camel’s reigns wrapped around his wrist. On their bactrian backs sugar canes strapped; Others silk, velvet - treasures of the east Their hooves leave clouds of swirling yellow dust They stomp and sway, not tired in the least. The Bedouin’s face, half covered with cloth The hollows of his eyes a dark shadow; The wind blows and rips at his long white robes His steps on the sand are sift and mellow. In these vast horizons he is alone It is only him and Allah his God; His thoughts are deep, the world he contemplates As he trudges forward clutching his rod. And now ‘tis the city of Cairo I see With its dusty streets and sandy buildings Its wide boulevards and colorful blooms Sphinxes and facades with golden gildings. I stare at the bricks zooming past my feet I stare at the blue sky stretched over me I stare at the palms waving in the wind And the Persian rose so red and thorny. The faces of Cairo pass my vision; Glittering black eyes, sculpted face, black hair Oriental fabrics wrapped around them Their step and their gait is so strong, so fair. My fingers are trailing over red stone The wind whistles through its porous surface; I feel so small, so insignificant And yet I feel I have found my purpose: Is it not nothing else but to stand here And feel the desert wind blow over me As my eyes fill with tears of happiness And the warm Egyptian rays cover me? To feel the grains of sand in my fingers As my vision quivers with heated sheen? To faint into the arms of the hot wind And be carried away into a dream Of Pharaohs and gold; of empires bright Of Arabs and camels, the golden sun The Nile that flows to eternity To the Mediterranean his son. The blue sky is spinning - I’m waking up It’s melting into darkness - what a dream! Oh beautiful Egypt - don’t go away! You’re ecstasy, euphoria supreme! ",
      "date_published": "2024-04-06T00:00:00Z"
    }
  ]
}
